kossnikita/at32f4xx-pac/src/at32f423/at32f423.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR2</name>
      <description>General purpose timer</description>
      <groupName>TIMER</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR2</name>
        <description>TMR2 global interrupt</description>
        <value>28</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL1</name>
          <displayName>CTRL1</displayName>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMEN</name>
              <description>Plus Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PMEN</name>
                <enumeratedValue>
                  <name>bit16</name>
                  <description>CVAL, PR and CxDT are 16-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit32</name>
                  <description>CVAL, PR and CxDT are extended from 16-bit to 32-bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divider</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CLKDIV</name>
                <enumeratedValue>
                  <name>NoDiv</name>
                  <description>No division, fDTS=fCK_INT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>Divided by 2, fDTS=fCK_INT/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>Divided by 4, fDTS=fCK_INT/4</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRBEN</name>
              <description>Period buffer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PRBENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Period buffer is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Period buffer is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>PRBENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Period buffer disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Period buffer enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWCMSEL</name>
              <description>Two-way count mode 
              selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TWCMSEL</name>
                <enumeratedValue>
                  <name>OneWay</name>
                  <description>One-way counting mode, depending on the OWCDIR bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mode1</name>
                  <description>Two-way counting mode1, count up and down alternately, the CxIF bit is set only when the counter counts down</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mode2</name>
                  <description>Two-way counting mode2, count up and down alternately, the CxIF bit is set only when the counter counts up</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mode3</name>
                  <description>Two-way counting mode3, count up and down alternately, the CxIF bit is set when the counter counts up/down</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OWCDIR</name>
              <description>One-way count direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OWCDIR</name>
                <enumeratedValue>
                  <name>Up</name>
                  <description>Up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Down</name>
                  <description>Down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMEN</name>
              <description>One cycle mode enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OCMEN</name>
                <enumeratedValue>
                  <name>Continuous</name>
                  <description>The counter does not stop at an update event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OneCycle</name>
                  <description>The counter stops at an update event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVFS</name>
              <description>Overflow event source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVFS</name>
                <enumeratedValue>
                  <name>Any</name>
                  <description>Counter overflow, setting the OVFSWTR bit or overflow event generated by slave timer controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Counter</name>
                  <description>Only counter overflow generates an overflow event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVFEN</name>
              <description>Overflow event enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVFENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Overflow is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Overflow is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>OVFENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Overflow disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Overflow enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMREN</name>
              <description>TMR enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TMRENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Timer is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Timer is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>TMRENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Timer disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Timer enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>C1INSEL</name>
              <description>C1IN selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1INSEL</name>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1 pin is connected to C1IRAW input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOR</name>
                  <description>The XOR result of CH1, CH2 and CH3 pins is connected to C1IRAW input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTOS</name>
              <description>Primary TMR output selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PTOS</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Update</name>
                  <description>Update</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ComparePulse</name>
                  <description>Compare pulse</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1ORAW</name>
                  <description>C1ORAW signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2ORAW</name>
                  <description>C2ORAW signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C3ORAW</name>
                  <description>C3ORAW signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C4ORAW</name>
                  <description>C4ORAW signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRS</name>
              <description>DMA request source</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRS</name>
                <enumeratedValue>
                  <name>CaptureCompare</name>
                  <description>Capture/compare event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overflow</name>
                  <description>Overflow event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
